In [1]:
import pandas as pd

In [7]:
dict1 = {
    'Name':['Raghav','Prashant','Kartik','Mohan','Durga'],
    'Marks':[98,89,67,90,99],
    'Gender':['Male','Male','Male','Male','Female']
}
df1=pd.DataFrame(dict1)
df1

       Name  Marks  Gender
0    Raghav     98    Male
1  Prashant     89    Male
2    Kartik     67    Male
3     Mohan     90    Male
4     Durga     99  Female

# Display top3 rows of the dataset

In [10]:
df1.head(3)

       Name  Marks Gender
0    Raghav     98   Male
1  Prashant     89   Male
2    Kartik     67   Male

# last 3 rows

In [15]:
df1.tail(3)
df1.shape

(5, 3)

In [19]:
print('no of rows',df1.shape[0])
print('no of column',df1.shape[1])

no of rows 5
no of column 3

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Marks   5 non-null      int64
 2   Gender  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

# check null values in the dataset

In [24]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False

In [30]:
df1.isnull().sum(axis=0) ## displaying column wise

Name      0
Marks     0
Gender    0
dtype: int64

In [33]:
df1.isnull().sum(axis=1) ## displaying row wise

0    0
1    0
2    0
3    0
4    0
dtype: int64

# Get overall statistics about the dataframe

In [36]:
df1.describe()

           Marks
count   5.000000
mean   88.600000
std    12.895736
min    67.000000
25%    89.000000
50%    90.000000
75%    98.000000
max    99.000000

df1.describe(include='all')

# unique values from the gender column

In [41]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [43]:
df1['Gender'].nunique()  ## no of unique values

2

# Display count of unique values in gender column

In [46]:
df1['Gender'].value_counts()

Gender
Male      4
Female    1
Name: count, dtype: int64

## find total no of students having marks between 90 and 100(Inclusive) using between method

In [51]:
df1['Marks']

0    98
1    89
2    67
3    90
4    99
Name: Marks, dtype: int64

In [69]:
df1[df1['Marks']>=90]

     Name  Marks  Gender
0  Raghav     98    Male
3   Mohan     90    Male
4   Durga     99  Female

In [73]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

     Name  Marks  Gender
0  Raghav     98    Male
3   Mohan     90    Male
4   Durga     99  Female

In [75]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

3

In [77]:
df1['Marks'].between(90,100)

0     True
1    False
2    False
3     True
4     True
Name: Marks, dtype: bool

In [79]:
df1['Marks'].between(90,100).sum()

3

# Find Average Marks

In [82]:
df1['Marks'].mean()

88.6

In [84]:
df1['Marks'].min()

67

In [88]:
def marks(x):
    return x/2

In [90]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    33.5
3    45.0
4    49.5
Name: Marks, dtype: float64

In [92]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [94]:
df1

       Name  Marks  Gender  Half_marks
0    Raghav     98    Male        49.0
1  Prashant     89    Male        44.5
2    Kartik     67    Male        33.5
3     Mohan     90    Male        45.0
4     Durga     99  Female        49.5

In [96]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    33.5
3    45.0
4    49.5
Name: Marks, dtype: float64

In [98]:
df1['Name'].apply(len)

0    6
1    8
2    6
3    5
4    5
Name: Name, dtype: int64

## Map Function

In [101]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    1
2    1
3    1
4    0
Name: Gender, dtype: int64

In [103]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [105]:
df1

       Name  Marks  Gender  Half_marks  Male_Female
0    Raghav     98    Male        49.0            1
1  Prashant     89    Male        44.5            1
2    Kartik     67    Male        33.5            1
3     Mohan     90    Male        45.0            1
4     Durga     99  Female        49.5            0

## Drop the columns

In [107]:
df1.drop('Male_Female',axis=1)

       Name  Marks  Gender  Half_marks
0    Raghav     98    Male        49.0
1  Prashant     89    Male        44.5
2    Kartik     67    Male        33.5
3     Mohan     90    Male        45.0
4     Durga     99  Female        49.5

In [114]:
df1.drop(['Male_Female','Half_marks'],axis=1,inplace=True)

In [116]:
df1

       Name  Marks  Gender
0    Raghav     98    Male
1  Prashant     89    Male
2    Kartik     67    Male
3     Mohan     90    Male
4     Durga     99  Female

In [118]:
df1.columns ## print name of columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

df1.sort_values(by='Marks',ascending=False)

In [122]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

       Name  Marks  Gender
4     Durga     99  Female
0    Raghav     98    Male
3     Mohan     90    Male
1  Prashant     89    Male
2    Kartik     67    Male

## print the female students

In [125]:
df1['Gender']=='Female'

0    False
1    False
2    False
3    False
4     True
Name: Gender, dtype: bool

In [127]:
df1[df1['Gender']=='Female']

    Name  Marks  Gender
4  Durga     99  Female

In [129]:
df1[df1['Gender']=='Female']['Name']

4    Durga
Name: Name, dtype: object

In [135]:
df1[df1['Gender']=='Female'][['Name','Marks']]

    Name  Marks
4  Durga     99

In [137]:
df1['Gender'].isin(['Female'])

0    False
1    False
2    False
3    False
4     True
Name: Gender, dtype: bool

In [139]:
df1[df1['Gender'].isin(['Female'])]

    Name  Marks  Gender
4  Durga     99  Female

In [141]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

    Name  Marks
4  Durga     99